---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.DemandFactorId
source: html/ae578380-e6de-dea0-dfe3-27b2bb5a6bc3.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.DemandFactorId Property

The demand factor definition this load classification element uses.

## Syntax (C#)
```csharp
public ElementId DemandFactorId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The element id elemId is not a valid ElectricalDemandFactorDefinition element.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null